FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_I2C.c
/*-------------------------------------------------------------------------*
 * File:  I2C.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1788 I2C Interface.
 * Implementation:
 *      A single I2C0 is created, but the code can be easily changed for
 *      other processors to use multiple I2C busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <uEZPlatform.h>
#include <uEZProcessor.h>
#include <uEZBSP.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC1788/LPC1788_I2C.h>

// Setup Master mode only.  Slave mode is a future version but we'll
// leave some of the code in so we don't have to write it later.
#define COMPILE_I2C_MASTER_MODE 1
#define COMPILE_I2C_SLAVE_MODE  0

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
// I2CONSET:
// Assert acknowledge flag
#define I2CONSET_AA     (1<<2)
// I2C interrupt flag
#define I2CONSET_SI     (1<<3)
// STOP flag
#define I2CONSET_STO    (1<<4)
// START flag
#define I2CONSET_STA    (1<<5)
// I2C interface enable
#define I2CONSET_I2EN   (1<<6)
// I2STAT:
// Status
#define I2STAT_STATUS_MASK  (0x1F<<3)
// I2DAT:
// I2ADR:
#define I2ADR_GC        (1<<0)
// I2SCLH:
// I2SCLL:
// I2CONCLR:
// Assert acknowledge Clear bit
#define I2CONCLR_AAC    (1<<2)
// I2C interrupt Clear bit
#define I2CONCLR_SIC    (1<<3)
// START flag Clear bit
#define I2CONCLR_STAC   (1<<5)
// I2C interface Disable bit
#define I2CONCLR_I2ENC  (1<<6)

#if 0
typedef TBool (*I2CSlaveIsLastReceiveByte)(T_LPC1788_I2C_Workspace *aWorkspace);
typedef TBool (*I2CSlaveIsLastTransmitByte)(T_LPC1788_I2C_Workspace *aWorkspace);
typedef void (*I2CTransferComplete)(T_LPC1788_I2C_Workspace *aWorkspace);
typedef void (*I2CSlaveReceiveByte)(T_LPC1788_I2C_Workspace *aWorkspace, TUInt8 aByte);
typedef TUInt8 (*I2CSlaveGetTransmitByte)(T_LPC1788_I2C_Workspace *aWorkspace);
#endif

typedef struct {
    const HAL_I2CBus *iHAL;
    LPC_I2C_TypeDef *iRegs;
    I2C_Request *iRequest;
    TUInt8 iAddress;
    TUInt8 *iData;
    TUInt8 iDataLen;
    TUInt8 iIndex;
    I2CRequestCompleteCallback iCompleteFunc;
    void *iCompleteWorkspace;
    TUInt16 iPowerBits;
    T_uezGPIOPortPin iSDAPin;
    T_uezGPIOPortPin iSCLPin;

    volatile TBool iDoneFlag;
#if COMPILE_I2C_SLAVE_MODE
I2CSlaveIsLastReceiveByte iI2CSlaveIsLastReceiveByte;
I2CSlaveIsLastTransmitByte iI2CSlaveIsLastTransmitByte;
I2CTransferComplete iI2CTransferComplete;
I2CSlaveReceiveByte iI2CSlaveReceiveByte;
I2CSlaveGetTransmitByte iI2CSlaveGetTransmitByte;
#endif
} T_LPC1788_I2C_Workspace;

typedef TUInt8 T_lpc1788_i2cMode;
#define I2C_MODE_READ           1
#define I2C_MODE_WRITE          0

/*-------------------------------------------------------------------------*
 * Macros:
 *-------------------------------------------------------------------------*/
#define I2C_ENABLE(p)       (((p)->iRegs)->CONSET) = I2CONSET_I2EN
#define I2C_DISABLE(p)      (((p)->iRegs)->CONCLR) = I2CONCLR_I2ENC
#define STA_SET(p)          (((p)->iRegs)->CONSET) = I2CONSET_STA
#define STA_CLEAR(p)        (((p)->iRegs)->CONCLR) = I2CONCLR_STAC
#define STO_SET(p)          (((p)->iRegs)->CONSET) = I2CONSET_STO
#define STO_CLEAR(p)        /* automatically cleared by hardware */
#define AA_SET(p)           (((p)->iRegs)->CONSET) = I2CONSET_AA
#define AA_CLEAR(p)         (((p)->iRegs)->CONCLR) = I2CONCLR_AAC
#define SI_CLEAR(p)         (((p)->iRegs)->CONCLR) = I2CONCLR_SIC
#define I2DAT_WRITE(p, v)   (((p)->iRegs)->DAT) = (v)
#define I2DAT_READ(p)       (((p)->iRegs)->DAT)

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
static T_LPC1788_I2C_Workspace *G_lpc1788_i2c0Workspace;
static T_LPC1788_I2C_Workspace *G_lpc1788_i2c1Workspace;
static T_LPC1788_I2C_Workspace *G_lpc1788_i2c2Workspace;

static const T_LPC1788_IOCON_ConfigList G_sda0[] = {
        {GPIO_P0_27,   IOCON_I_DEFAULT(1) | IOCON_OPEN_DRAIN},
        {GPIO_P1_30,   IOCON_A(4, IOCON_NO_PULL, IOCON_HYS_ENABLE,
                                                IOCON_INVERT_OFF, IOCON_DIGITAL, IOCON_FILTER_OFF,
                                                IOCON_OPEN_DRAIN, IOCON_DAC_DISABLE)},
        {GPIO_P5_2, IOCON_I_DEFAULT(5) | IOCON_OPEN_DRAIN},
};
static const T_LPC1788_IOCON_ConfigList G_scl0[] = {
        {GPIO_P0_28,   IOCON_I_DEFAULT(1) | IOCON_OPEN_DRAIN},
        {GPIO_P1_31,   IOCON_A(4, IOCON_NO_PULL, IOCON_HYS_ENABLE,
                                                IOCON_INVERT_OFF, IOCON_DIGITAL, IOCON_FILTER_OFF,
                                                IOCON_OPEN_DRAIN, IOCON_DAC_DISABLE)},
        {GPIO_P5_3, IOCON_I_DEFAULT(5) | IOCON_OPEN_DRAIN},
};

static const T_LPC1788_IOCON_ConfigList G_sda1[] = {
        {GPIO_P0_0,     IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P0_19,   IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_14, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};
static const T_LPC1788_IOCON_ConfigList G_scl1[] = {
        {GPIO_P0_1,     IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P0_20,   IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_15, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};

static const T_LPC1788_IOCON_ConfigList G_sda2[] = {
        {GPIO_P0_10, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P1_15, IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_30, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_20, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};
static const T_LPC1788_IOCON_ConfigList G_scl2[] = {
        {GPIO_P0_11, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_31, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_21, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_29, IOCON_D(4, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};

