FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_I2C.c
IRQ_ROUTINE(ILPC1788_I2C1InterruptHandler)
{
    IRQ_START();
    ILPC1788_ProcessState(G_lpc1788_i2c1Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(ILPC1788_I2C2InterruptHandler)
{
    IRQ_START();
    ILPC1788_ProcessState(G_lpc1788_i2c2Workspace);
    IRQ_END()
    ;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_I2C_Bus0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1788 I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_I2C_Bus0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1788_I2C_Workspace *p = (T_LPC1788_I2C_Workspace *)aWorkspace;
    p->iRegs = LPC_I2C0;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1788_i2c0Workspace = p;
    p->iPowerBits = 7;

    // Setup interrupt vector
    InterruptRegister(I2C0_IRQn, ILPC1788_I2C0InterruptHandler,
            INTERRUPT_PRIORITY_NORMAL, "I2C0");
    InterruptEnable(I2C0_IRQn);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_I2C_Bus1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1788 I2C Bus1 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_I2C_Bus1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1788_I2C_Workspace *p = (T_LPC1788_I2C_Workspace *)aWorkspace;
    p->iRegs = LPC_I2C1;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1788_i2c1Workspace = p;
    p->iPowerBits = 19;

    // Setup interrupt vector
    InterruptRegister(I2C1_IRQn, ILPC1788_I2C1InterruptHandler,
            INTERRUPT_PRIORITY_NORMAL, "I2C1");
    InterruptEnable(I2C1_IRQn);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_I2C_Bus2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1788 I2C Bus2 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_I2C_Bus2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1788_I2C_Workspace *p = (T_LPC1788_I2C_Workspace *)aWorkspace;
    p->iRegs = LPC_I2C2;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1788_i2c2Workspace = p;
    p->iPowerBits = 26;

    // Setup interrupt vector
    InterruptRegister(I2C2_IRQn, ILPC1788_I2C2InterruptHandler,
            INTERRUPT_PRIORITY_NORMAL, "I2C2");
    InterruptEnable(I2C2_IRQn);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_I2CBus I2C_LPC1788_Bus0_Interface = { {
        "LPC1788 I2C Bus0",
        0x0100,
        LPC1788_I2C_Bus0_InitializeWorkspace,
        sizeof(T_LPC1788_I2C_Workspace), },

ILPC1788_I2C_StartRead, ILPC1788_I2C_StartWrite,
0,0,0,
ILPC1788_I2C_IsHung, ILPC1788_I2C_ResetBus};

const HAL_I2CBus I2C_LPC1788_Bus1_Interface = { {
        "LPC1788 I2C Bus1",
        0x0100,
        LPC1788_I2C_Bus1_InitializeWorkspace,
        sizeof(T_LPC1788_I2C_Workspace), },

ILPC1788_I2C_StartRead, ILPC1788_I2C_StartWrite,
0,0,0,
ILPC1788_I2C_IsHung, ILPC1788_I2C_ResetBus};

const HAL_I2CBus I2C_LPC1788_Bus2_Interface = { {
        "LPC1788 I2C Bus2",
        0x0100,
        LPC1788_I2C_Bus2_InitializeWorkspace,
        sizeof(T_LPC1788_I2C_Workspace), },

ILPC1788_I2C_StartRead, ILPC1788_I2C_StartWrite,
0,0,0,
ILPC1788_I2C_IsHung, ILPC1788_I2C_ResetBus};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_I2C0_Require(
        T_uezGPIOPortPin aPinSDA0,
        T_uezGPIOPortPin aPinSCL0)
{
    T_LPC1788_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C0 Bus driver
    HALInterfaceRegister("I2C0", (T_halInterface *)&I2C_LPC1788_Bus0_Interface,
            0, (T_halWorkspace **)&p);
    LPC1788_IOCON_ConfigPin(aPinSDA0, G_sda0, ARRAY_COUNT(G_sda0));
    LPC1788_IOCON_ConfigPin(aPinSCL0, G_scl0, ARRAY_COUNT(G_scl0));

    p->iSCLPin = aPinSCL0;
    p->iSDAPin = aPinSDA0;
}

void LPC1788_I2C1_Require(
        T_uezGPIOPortPin aPinSDA1,
        T_uezGPIOPortPin aPinSCL1)
{
    T_LPC1788_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C1 Bus driver
    HALInterfaceRegister("I2C1", (T_halInterface *)&I2C_LPC1788_Bus1_Interface,
            0, (T_halWorkspace **)&p);
    LPC1788_IOCON_ConfigPin(aPinSDA1, G_sda1, ARRAY_COUNT(G_sda1));
    LPC1788_IOCON_ConfigPin(aPinSCL1, G_scl1, ARRAY_COUNT(G_scl1));

    p->iSCLPin = aPinSCL1;
    p->iSDAPin = aPinSDA1;
}

void LPC1788_I2C2_Require(
        T_uezGPIOPortPin aPinSDA2,
        T_uezGPIOPortPin aPinSCL2)
{
    T_LPC1788_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C0 Bus driver
    HALInterfaceRegister("I2C2", (T_halInterface *)&I2C_LPC1788_Bus2_Interface,
            0, (T_halWorkspace **)&p);

    LPC1788_IOCON_ConfigPin(aPinSDA2, G_sda2, ARRAY_COUNT(G_sda2));
    LPC1788_IOCON_ConfigPin(aPinSCL2, G_scl2, ARRAY_COUNT(G_scl2));

    p->iSCLPin = aPinSCL2;
    p->iSDAPin = aPinSDA2;
}

/*-------------------------------------------------------------------------*
 * End of File:  I2C.c
 *-------------------------------------------------------------------------*/
